In [ ]:
# df.iloc[:1:4] #rows, #columns
# df.iloc[:1:4].agg(["max","min","mean"]).round(1)
# df.groupby("column_name").agg_function #NEED AGGREGATE FUNCTION
# df.groupby("room").max()
# df.groupby("room").agg(["min","max"])
# df.groupby("room").describe().T
# pd.concat([df1,df2, axis=0]) #0 is lengthwise 
# #use df.reset_index()
# pd.concat([df1,df2, axis=1]) #1 is widthwise
# #chnage names of columns to get rid of duplicates

In [ ]:
# pd.merge(users,roles,how="inner",left_on="role_id,right_on="id",indicator=True)

In [26]:
# from env import host, username, password, database
# # import pandas as pd

In [37]:
# def get_db_url3(user,password,host,database):
#     return f'mysql+pymysql://{username}:{password}@{host}/{database}'

In [41]:
# when pulling more than one column, use double brackets!!!!![[]]
# Boolean masking df.head()
# df.room == "B"
# mask = df.room == "B"
# df[mask].name
# df.reset_index()# resets index
# df.math.agg("min","max","mean")
# df.math.max("max")
# df[["math,","reading","english"]].agg(["max","min","mean"]).round(1)

NameError: name 'df' is not defined

In [43]:
from env import host, username, password, database
import pandas as pd
def get_db_url():
    url =f'mysql+pymysql://{username}:{password}@{host}/{database}'
    return url

In [44]:
from env import host, username, password, database
import pandas as pd

In [45]:


url =f'mysql+pymysql://{username}:{password}@{host}/{database}'

query = 'SELECT * FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(query,get_db_url())

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [46]:
pd.read_sql('select * from employees',get_db_url())

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
#Unknown columns error

query = 'SELECT ll FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(query,get_db_url())

In [48]:
employees = pd.read_sql('select * from employees', url)

In [51]:
titles = pd.read_sql('select * from titles', url)

In [39]:
#url =f'mysql+pymysql://{username}:{password}@{host}/{database}'
def get_db_url2():
    url2 =f'mysql+pymysql://{username}:{password}@{host}/{database}'
    return url2
        
query2 = 'SELECT * FROM titles'

pd.read_sql(query2,get_db_url2())

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [17]:
yo = pd.DataFrame(pd.read_sql(query,get_db_url()))
yo

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [55]:
employees.shape

(300024, 6)

In [52]:
titles.shape

(443308, 4)

In [59]:
titles.describe(include="all")

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [56]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [57]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [53]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [60]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [61]:
titles.title.unique().shape

(7,)

In [64]:
len(titles.title.unique())

7

In [62]:
titles.title.nunique()

7

In [63]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000